artillery.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    # Làm nóng app với tải nhẹ trước khi vào phase chính.
    - name: warm_up
      duration: 30
      arrivalRate: 1
    # Phase chính để đo UI dưới tải nhẹ-trung bình.
    - name: ui_load
      duration: 60
      arrivalRate: 3
  engines:
    playwright:
      launchOptions:
        headless: true
      defaultNavigationTimeout: 30
      aggregateByName: true
      extendedMetrics: true
      trace:
        enabled: true
        maxConcurrentRecordings: 3
  plugins:
    ensure:
      thresholds:
        - "browser.page.LCP.agg.p95": 80000
        - "browser.page.FCP.agg.p95": 10000
  processor: "./flows.js"

scenarios:
  # Test trang học tập: load môn, mở menu bài học, mở offcanvas, bấm flashcard.
  - name: learn_ui
    engine: playwright
    testFunction: "learnFlow"

  # Test trang challenge: mở quiz modal, chọn đáp án, sang câu tiếp theo.
  - name: challenge_ui
    engine: playwright
    testFunction: "challengeFlow"

  # Test trang contact: điền form và submit feedback.
  - name: contact_ui
    engine: playwright
    testFunction: "contactFlow"